package Seminars.sem1;

/**
 * Другой, очень полезный класс приложения. Здесь мы можем описать
 * его основное назначение и способы взаимодействия с ним.
 */
public class OtherClass {
    /**
     * Функция суммирования двух чисел
     *
     * @param a первое слагаемое
     * @param b второе слагаемое
     * @return сумма a и b, без проверки на переполнение переменной.
     */
    public static int sum(int a, int b) {
        return a + b; // Возврат без проверки переполнения
    }

    /**
     * Функция вычитания двух чисел
     *
     * @param a первое слагаемое
     * @param b второе слагаемое
     * @return сумма a и b, без проверки на переполнение переменной.
     */
    public static int sub(int a, int b) {
        return a - b; // Возврат без проверки переполнения
    }

    /**
     * Функция умножения двух чисел
     *
     * @param a первое слагаемое
     * @param b второе слагаемое
     * @return сумма a и b, без проверки на переполнение переменной.
     */
    public static int mult(int a, int b) {
        return a * b; // Возврат без проверки переполнения
    }

    /**
     * Функция деления двух чисел
     *
     * @param a первое слагаемое
     * @param b второе слагаемое
     * @return сумма a и b, без проверки на переполнение переменной.
     */
    public static int div(int a, int b) {
        return a / b; // Возврат без проверки переполнения
    }

}
